#version: 0.2
Ġ (
Ġ )
A R
V AR
Ġ VAR
Ġ ;
E T
H O
M ET
HO D
MET HOD
Ġ METHOD
Ġ .
P E
T Y
TY PE
Ġ TYPE
č Ċ
Ġ {
Ġ }
Ġ ,
n g
Ġ =
v a
Ġ i
Ġ j
a va
Ġj ava
e t
Ġ n
n t
l a
i c
Ġ t
r i
b l
I N
u bl
la ng
Ġ r
p ubl
publ ic
i d
o id
u r
Ġ S
R IN
T RIN
ĠS TRIN
ĠSTRIN G
Ġ v
et ur
Ġr etur
Ġretur n
Ġv oid
t ri
tri ng
S tring
e w
Ġi f
t e
Ġ f
Ġ čĊ
Ġ s
i s
Ġt h
u l
Ġn ew
s e
t i
Ġi nt
a l
ul l
Ġ <
Ġn ull
a t
Ġ +
l e
Ġ >
Ġ c
Ġth is
Ġ a
g et
Ġ get
Ġ e
r o
u e
Ġ 0
p ri
Ġ !
Ġ b
Ġt r
u ti
uti l
nt e
Ġ [
Ġ ]
o n
a n
Ġ= =
i n
e r
Ġs t
Ġ IN
ĠIN T
va te
pri vate
n d
ti on
Ġ :
ro w
Ġ! =
Ġ 1
c e
is t
o r
o o
le an
oo lean
m e
Ġth row
u t
Ġ p
Ġtr ue
al se
Ġf alse
Ġb oolean
Ġr e
L ist
l se
Ġe lse
in al
Ġf inal
Ġst at
x t
Ġf or
o nte
Ġ d
i ew
c h
Ġstat ic
E x
p tion
ce ption
Ex ception
Ġthrow s
Ġ -
te m
s s
Ġre s
a me
i le
a r
i o
o ut
Ġ l
r oid
Ġa nd
Ġand roid
i z
iz e
I nte
ul t
y s
Ġtr y
q u
al s
qu als
at ch
Ġ &
Ġc atch
u p
d d
Ġa dd
la ss
S ys
Sys tem
Ġ& &
i t
Ġres ult
Ġ va
pri nt
l ue
Ġva lue
Ġt o
c te
te cte
ro tecte
rotecte d
Ġs ize
p rotected
l n
print ln
Ġ+ +
o ng
e c
onte xt
e nt
r a
b j
Ġs up
Ġsup er
r ra
o ubl
oubl e
Ġs et
e xt
t h
ng th
le ngth
a se
Ġ length
rra y
e a
onte nt
a te
Ġc o
Ġn ame
p e
Ġe quals
Ġi d
r t
s se
sse rt
Ġc lass
r ea
Ġto String
Ġi n
Ġa ssert
Ġd ouble
ec t
k e
O bj
Obj ect
Ġc ase
I O
IO Exception
Ġl ong
c ontent
A rray
Array List
g er
Ġ ?
Ġ |
Inte ger
Ġ x
Ġc ontext
T ext
m p
i tion
o s
Ġp os
Ġpos ition
at a
V iew
e x
Inte nt
Ġ m
Ġ| |
v iew
Ġ ke
Ġd ata
Ġi nd
Ġind ex
N ame
Ġp ut
Ġke y
Ġf ile
Ġv iew
Ġ *
Ġ w
Ġb rea
Ġbrea k
Ġint ent
F ile
s t
Ġ y
a in
Ġst ar
Ġstar t
at h
r g
Ġa rg
Ġi tem
l d
a p
M ap
y pe
v ent
Ġe vent
v e
o d
Ġ o
l o
Ġarg s
o w
a g
Ġ me
ss ag
Ġme ssag
Ġmessag e
lo at
m o
Ġre mo
Ġremo ve
Ġset Text
E quals
h ile
Ġw hile
Ġ /
1 0
Ġget I
Ġassert Equals
Ġget Name
Ġf loat
p on
Ġres pon
Ġrespon se
f f
T h
Ġn od
Ġnod e
Ġb u
Ġ+ =
Ġt ype
Ġe x
E mp
s Emp
t y
Ġi sEmp
ĠisEmp ty
Ġget C
Ġl ist
te r
V al
Val ue
i ld
Ġ out
an ce
st ance
ĠgetI d
Ġs h
Ġco u
Ġp ath
Ġget String
Ġco nt
Ġ> =
r ro
Ġe rro
Ġerro r
y te
Ġb yte
n ch
n ize
y nch
ro nize
ynch ronize
ynchronize d
f o
Ġin fo
pe nd
Ġs ynchronized
a s
o f
Ġin stance
Ġinstance of
p pend
Ġa ppend
r y
Ġsh ow
a m
Ġp ar
Ġpar am
i me
ain s
Ġcont ains
A T
F L
O AT
Ġ FL
ĠFL OAT
q ue
Ġvalue s
p ut
L ong
Ġget Text
Ġcou nt
w it
Ġs wit
Ġswit ch
u m
S et
a bl
abl e
B u
Ġd e
u te
m at
Ġ "
Ġ ur
Ġur l
Ġ< =
A c
v it
ti vit
Ġget Ac
tivit y
ĠgetAc tivity
Ġ que
Ġque ry
ff er
d ate
Ġ up
Ġup date
Ġst ate
Ġget Value
Ġ public
ec ute
Ġex ecute
Ġt ext
s g
Ġm sg
H as
Has h
Ġf i
Ġm ain
Ġo bj
Ġ h
1 1
n er
C lass
D ate
C H
Ġ CH
ĠCH AR
B oolean
u s
Ġstat us
o l
Ġbu ild
b s
Ġin it
v oid
at or
ter ator
String Bu
le c
Ġn um
Ġget T
Ġparam s
in e
i g
r ue
p la
Ġre pla
Ġrepla ce
C ontext
Ġt ar
Ġtar get
S t
Ġst r
e mp
Ġt emp
an d
h ar
ild er
ĠgetC ontext
Ġe nd
Ġl ine
Ġd ate
D ouble
Ġ- -
C ol
StringBu ilder
Ġout put
rea d
Th read
p ar
par se
Hash Map
ĠgetC lass
te ner
is tener
Ġl istener
Ġt it
Ġtit le
Ġa rray
T rue
Ġassert True
lec tion
Ġbu ffer
e ig
h t
Ġh eig
Ġheig ht
e ld
Ġfi eld
o ur
Ġs our
Ġsour ce
ri ter
Ġt ime
u bs
Ġs ubs
Ġsubs tring
f or
for mat
. .
Ġ. ..
le me
leme nt
I n
row able
Th rowable
Ġe lement
a ult
f ault
Ġde fault
C ase
er Case
rea m
put St
putSt ream
s et
Ġo ff
Ġoff set
Col lection
I nt
parse Int
Ġi terator
N ull
Ġc ontent
M ath
E n
Ġset En
able d
ĠsetEn abled
l et
Ġde let
Ġdelet e
l y
Ġfinal ly
Ġ %
nte r
m m
Ġco mm
Ġcomm it
Ġfor mat
Ġc har
1 2
l it
p lit
Ġs plit
Ġm in
o t
Ġto ke
Ġtoke n
te nd
Ġex tend
Ġextend s
Ġfile Name
N ot
n ame
Ġt ri
Ġtri m
Ġassert Th
ĠassertTh at
Ġ k
L ow
Ġto Low
ĠtoLow erCase
In putStream
b er
Ġnum ber
Ġ" \
Ġw riter
ĠgetT ype
o m
and om
Ġs tring
T o
e To
ar eTo
Ġco mp
Ġcomp areTo
Ġs um
C al
e nd
Cal end
Calend ar
V oid
ĠgetT ime
r st
Ġfi rst
Ġresult s
Ġset Value
A rra
as List
Arra ys
Hash Set
ĠgetI nt
h od
et hod
Ġm ethod
T ime
b e
Ġ la
be l
Ġla bel
et er
Ġparam eter
Ġparameter s
Ġassert Not
ĠassertNot Null
D ata
Ġget Data
Ġh and
Ġhand le
R andom
e d
Bu ffer
Buffer ed
Ġfile name
Ġt mp
at ic
st atic
R ea
d er
Rea der
Ġ- =
or t
Ġcou nter
S c
an ner
Sc anner
1 3
p er
pe n
Ġo pen
er r
u nd
I terator
S e
P o
i nter
Null Po
inter Exception
NullPo interException
ke d
L in
ked List
Lin kedList
Ġget Boolean
E nt
Ent ry
a bs
Ġget Intent
A l
Ġreplace Al
ĠreplaceAl l
R L
U RL
n et
P ath
W it
s Wit
Ġfile Path
Ġstart sWit
ĠstartsWit h
a i
Ġf ai
Ġfai l
Ġbu f
Ġstart Time
Buffered Reader
Ġclass Name
Ġget View
o String
t oString
w id
wid get
Ġke ys
C har
n ce
que nce
Se quence
Char Sequence
F o
n s
w er
Ġa ns
Ġans wer
W riter
ex it
Ġsh ort
r c
Ġs rc
at ter
Ġp atter
Ġpatter n
1 4
ĠgetC ol
ĠgetCol or
j ava
in ue
Ġcont inue
P ro
e s
te p
Ġs tep
ti es
per ties
Pro perties
get In
getIn stance
Class Not
und Exception
Fo undException
ClassNot FoundException
F loat
e lec
Ġs elec
Ġselec t
Ġint Value
Ġname s
File InputStream
U p
p erCase
Ġto Up
ĠtoUp perCase
Ġnode s
O ut
File Out
FileOut putStream
p r
Ġex pr
Ġset St
ĠsetSt ate
L o
g ger
Lo gger
B ut
t on
But ton
Ġerror s
StringBu ffer
Ġr ow
Ġrow s
a w
Ġo p
aw t
f ig
on fig
ĠgetC onfig
d s
or ds
Ġw ords
Ġd o
p ow
Ġfield Name
Ġva r
w ri
wri te
b oolean
b st
c t
ra ct
bst ract
Ġend Time
s ort
Collection s
i ff
Ġd iff
r andom
t rue
1 5
File Writer
Col or
a tion
Ġa bstract
Ġo per
Ġoper ation
b ute
Ġ at
tri bute
Ġat tribute
a ti
ati ve
Ġn ative
ro und
parse Long
ĠS tring
c tion
n ction
u nction
Ġf unction
Buffered Writer
Ġ* =
A ssert
a ssert
Ġ or
te st
assert Equals
Ġor g
test ng
V ect
Vect or
File Reader
Ġ| =
M atch
e g
r eg
Match er
reg ex
g g
i ng
get Logger
lo gg
logg ing
1 6
i nt
L a
L ine
y out
ar La
Line arLa
LinearLa yout
f alse
Ġget Se
ĠgetSe lection
Ġ ^
1 7
Ġ/ =
Ġ& =
t ype
C o
on ent
Ġadd Co
mp onent
ĠaddCo mponent
1 8
Ġ ~
Ġp rotected
Fo nt
f inal
ap pend
Bu ilder
Ġstring Builder
1 9
Ġn ot
L L
N U
Ġ NU
ĠNU LL
2 0
d ouble
s ynchronized
2 1
l ong
Ġ^ =
2 2
Ġ private
2 3
< =
Ġ< <=
Ġ% =
2 4
a bstract
> =
2 5
b yte
Ġ> >=
2 6
f loat
2 7
> >=
Ġ> >>=
2 8
2 9
Ġi mp
and roid
lement s
Ġimp lements
h ort
s hort
3 0
3 1
3 2
3 3
3 4
3 5
3 6
3 7
3 8
3 9
n ative
s ize
u nch
ch ar
ec ked
unch ecked
