{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"Ġ(":261,"Ġ)":262,"AR":263,"VAR":264,"ĠVAR":265,"Ġ;":266,"ET":267,"HO":268,"MET":269,"HOD":270,"METHOD":271,"ĠMETHOD":272,"Ġ.":273,"PE":274,"TY":275,"TYPE":276,"ĠTYPE":277,"čĊ":278,"Ġ{":279,"Ġ}":280,"Ġ,":281,"ng":282,"Ġ=":283,"va":284,"Ġi":285,"Ġj":286,"ava":287,"Ġjava":288,"et":289,"Ġn":290,"nt":291,"la":292,"ic":293,"Ġt":294,"ri":295,"bl":296,"IN":297,"ubl":298,"lang":299,"Ġr":300,"publ":301,"public":302,"id":303,"oid":304,"ur":305,"ĠS":306,"RIN":307,"TRIN":308,"ĠSTRIN":309,"ĠSTRING":310,"Ġv":311,"etur":312,"Ġretur":313,"Ġreturn":314,"Ġvoid":315,"tri":316,"tring":317,"String":318,"ew":319,"Ġif":320,"te":321,"Ġf":322,"ĠčĊ":323,"Ġs":324,"is":325,"Ġth":326,"ul":327,"Ġnew":328,"se":329,"ti":330,"Ġint":331,"al":332,"ull":333,"Ġ<":334,"Ġnull":335,"at":336,"Ġ+":337,"le":338,"Ġ>":339,"Ġc":340,"Ġthis":341,"Ġa":342,"get":343,"Ġget":344,"Ġe":345,"ro":346,"ue":347,"Ġ0":348,"pri":349,"Ġ!":350,"Ġb":351,"Ġtr":352,"uti":353,"util":354,"nte":355,"Ġ[":356,"Ġ]":357,"on":358,"an":359,"Ġ==":360,"in":361,"er":362,"Ġst":363,"ĠIN":364,"ĠINT":365,"vate":366,"private":367,"nd":368,"tion":369,"Ġ:":370,"row":371,"Ġ!=":372,"Ġ1":373,"ce":374,"ist":375,"or":376,"oo":377,"lean":378,"oolean":379,"me":380,"Ġthrow":381,"ut":382,"Ġp":383,"Ġtrue":384,"alse":385,"Ġfalse":386,"Ġboolean":387,"Ġre":388,"List":389,"lse":390,"Ġelse":391,"inal":392,"Ġfinal":393,"Ġstat":394,"xt":395,"Ġfor":396,"onte":397,"Ġd":398,"iew":399,"ch":400,"Ġstatic":401,"Ex":402,"ption":403,"ception":404,"Exception":405,"Ġthrows":406,"Ġ-":407,"tem":408,"ss":409,"Ġres":410,"ame":411,"ile":412,"ar":413,"io":414,"out":415,"Ġl":416,"roid":417,"Ġand":418,"Ġandroid":419,"iz":420,"ize":421,"Inte":422,"ult":423,"ys":424,"Ġtry":425,"qu":426,"als":427,"quals":428,"atch":429,"Ġ&":430,"Ġcatch":431,"up":432,"dd":433,"Ġadd":434,"lass":435,"Sys":436,"System":437,"Ġ&&":438,"it":439,"Ġresult":440,"Ġva":441,"print":442,"lue":443,"Ġvalue":444,"Ġto":445,"cte":446,"tecte":447,"rotecte":448,"rotected":449,"Ġsize":450,"protected":451,"ln":452,"println":453,"Ġ++":454,"ong":455,"ec":456,"ontext":457,"ent":458,"ra":459,"bj":460,"Ġsup":461,"Ġsuper":462,"rra":463,"oubl":464,"ouble":465,"Ġset":466,"ext":467,"th":468,"ngth":469,"length":470,"ase":471,"Ġlength":472,"rray":473,"ea":474,"ontent":475,"ate":476,"Ġco":477,"Ġname":478,"pe":479,"Ġequals":480,"Ġid":481,"rt":482,"sse":483,"ssert":484,"Ġclass":485,"rea":486,"ĠtoString":487,"Ġin":488,"Ġassert":489,"Ġdouble":490,"ect":491,"ke":492,"Obj":493,"Object":494,"Ġcase":495,"IO":496,"IOException":497,"Ġlong":498,"content":499,"Array":500,"ArrayList":501,"ger":502,"Ġ?":503,"Ġ|":504,"Integer":505,"Ġx":506,"Ġcontext":507,"Text":508,"mp":509,"ition":510,"os":511,"Ġpos":512,"Ġposition":513,"ata":514,"View":515,"ex":516,"Intent":517,"Ġm":518,"Ġ||":519,"view":520,"Ġke":521,"Ġdata":522,"Ġind":523,"Ġindex":524,"Name":525,"Ġput":526,"Ġkey":527,"Ġfile":528,"Ġview":529,"Ġ*":530,"Ġw":531,"Ġbrea":532,"Ġbreak":533,"Ġintent":534,"File":535,"st":536,"Ġy":537,"ain":538,"Ġstar":539,"Ġstart":540,"ath":541,"rg":542,"Ġarg":543,"Ġitem":544,"ld":545,"ap":546,"Map":547,"ype":548,"vent":549,"Ġevent":550,"ve":551,"od":552,"Ġo":553,"lo":554,"Ġargs":555,"ow":556,"ag":557,"Ġme":558,"ssag":559,"Ġmessag":560,"Ġmessage":561,"loat":562,"mo":563,"Ġremo":564,"Ġremove":565,"ĠsetText":566,"Equals":567,"hile":568,"Ġwhile":569,"Ġ/":570,"10":571,"ĠgetI":572,"ĠassertEquals":573,"ĠgetName":574,"Ġfloat":575,"pon":576,"Ġrespon":577,"Ġresponse":578,"ff":579,"Th":580,"Ġnod":581,"Ġnode":582,"Ġbu":583,"Ġ+=":584,"Ġtype":585,"Ġex":586,"Emp":587,"sEmp":588,"ty":589,"ĠisEmp":590,"ĠisEmpty":591,"ĠgetC":592,"Ġlist":593,"ter":594,"Val":595,"Value":596,"ild":597,"Ġout":598,"ance":599,"stance":600,"ĠgetId":601,"Ġsh":602,"Ġcou":603,"Ġpath":604,"ĠgetString":605,"Ġcont":606,"Ġ>=":607,"rro":608,"Ġerro":609,"Ġerror":610,"yte":611,"Ġbyte":612,"nch":613,"nize":614,"ynch":615,"ronize":616,"ynchronize":617,"ynchronized":618,"fo":619,"Ġinfo":620,"pend":621,"Ġsynchronized":622,"as":623,"of":624,"Ġinstance":625,"Ġinstanceof":626,"ppend":627,"Ġappend":628,"ry":629,"Ġshow":630,"am":631,"Ġpar":632,"Ġparam":633,"ime":634,"ains":635,"Ġcontains":636,"AT":637,"FL":638,"OAT":639,"ĠFL":640,"ĠFLOAT":641,"que":642,"Ġvalues":643,"put":644,"Long":645,"ĠgetText":646,"Ġcount":647,"wit":648,"Ġswit":649,"Ġswitch":650,"um":651,"Set":652,"abl":653,"able":654,"Bu":655,"Ġde":656,"ute":657,"mat":658,"Ġ\"":659,"Ġur":660,"Ġurl":661,"Ġ<=":662,"Ac":663,"vit":664,"tivit":665,"ĠgetAc":666,"tivity":667,"ĠgetActivity":668,"Ġque":669,"Ġquery":670,"ffer":671,"date":672,"Ġup":673,"Ġupdate":674,"Ġstate":675,"ĠgetValue":676,"Ġpublic":677,"ecute":678,"Ġexecute":679,"Ġtext":680,"sg":681,"Ġmsg":682,"Has":683,"Hash":684,"Ġfi":685,"Ġmain":686,"Ġobj":687,"Ġh":688,"11":689,"ner":690,"Class":691,"Date":692,"CH":693,"ĠCH":694,"ĠCHAR":695,"Boolean":696,"us":697,"Ġstatus":698,"ol":699,"Ġbuild":700,"bs":701,"Ġinit":702,"void":703,"ator":704,"terator":705,"StringBu":706,"lec":707,"Ġnum":708,"ĠgetT":709,"Ġparams":710,"ine":711,"ig":712,"rue":713,"pla":714,"Ġrepla":715,"Ġreplace":716,"Context":717,"Ġtar":718,"Ġtarget":719,"St":720,"Ġstr":721,"emp":722,"Ġtemp":723,"and":724,"har":725,"ilder":726,"ĠgetContext":727,"Ġend":728,"Ġline":729,"Ġdate":730,"Double":731,"Ġ--":732,"Col":733,"StringBuilder":734,"Ġoutput":735,"read":736,"Thread":737,"par":738,"parse":739,"HashMap":740,"ĠgetClass":741,"tener":742,"istener":743,"Ġlistener":744,"Ġtit":745,"Ġtitle":746,"Ġarray":747,"True":748,"ĠassertTrue":749,"lection":750,"Ġbuffer":751,"eig":752,"ht":753,"Ġheig":754,"Ġheight":755,"eld":756,"Ġfield":757,"our":758,"Ġsour":759,"Ġsource":760,"riter":761,"Ġtime":762,"ubs":763,"Ġsubs":764,"Ġsubstring":765,"for":766,"format":767,"..":768,"Ġ...":769,"leme":770,"lement":771,"In":772,"rowable":773,"Throwable":774,"Ġelement":775,"ault":776,"fault":777,"Ġdefault":778,"Case":779,"erCase":780,"ream":781,"putSt":782,"putStream":783,"set":784,"Ġoff":785,"Ġoffset":786,"Collection":787,"Int":788,"parseInt":789,"Ġiterator":790,"Null":791,"Ġcontent":792,"Math":793,"En":794,"ĠsetEn":795,"abled":796,"ĠsetEnabled":797,"let":798,"Ġdelet":799,"Ġdelete":800,"ly":801,"Ġfinally":802,"Ġ%":803,"nter":804,"mm":805,"Ġcomm":806,"Ġcommit":807,"Ġformat":808,"Ġchar":809,"12":810,"lit":811,"plit":812,"Ġsplit":813,"Ġmin":814,"ot":815,"Ġtoke":816,"Ġtoken":817,"tend":818,"Ġextend":819,"Ġextends":820,"ĠfileName":821,"Not":822,"name":823,"Ġtri":824,"Ġtrim":825,"ĠassertTh":826,"ĠassertThat":827,"Ġk":828,"Low":829,"ĠtoLow":830,"ĠtoLowerCase":831,"InputStream":832,"ber":833,"Ġnumber":834,"Ġ\"\\":835,"Ġwriter":836,"ĠgetType":837,"om":838,"andom":839,"Ġstring":840,"To":841,"eTo":842,"areTo":843,"Ġcomp":844,"ĠcompareTo":845,"Ġsum":846,"Cal":847,"end":848,"Calend":849,"Calendar":850,"Void":851,"ĠgetTime":852,"rst":853,"Ġfirst":854,"Ġresults":855,"ĠsetValue":856,"Arra":857,"asList":858,"Arrays":859,"HashSet":860,"ĠgetInt":861,"hod":862,"ethod":863,"Ġmethod":864,"Time":865,"be":866,"Ġla":867,"bel":868,"Ġlabel":869,"eter":870,"Ġparameter":871,"Ġparameters":872,"ĠassertNot":873,"ĠassertNotNull":874,"Data":875,"ĠgetData":876,"Ġhand":877,"Ġhandle":878,"Random":879,"ed":880,"Buffer":881,"Buffered":882,"Ġfilename":883,"Ġtmp":884,"atic":885,"static":886,"Rea":887,"der":888,"Reader":889,"Ġ-=":890,"ort":891,"Ġcounter":892,"Sc":893,"anner":894,"Scanner":895,"13":896,"per":897,"pen":898,"Ġopen":899,"err":900,"und":901,"Iterator":902,"Se":903,"Po":904,"inter":905,"NullPo":906,"interException":907,"NullPointerException":908,"ked":909,"Lin":910,"kedList":911,"LinkedList":912,"ĠgetBoolean":913,"Ent":914,"Entry":915,"abs":916,"ĠgetIntent":917,"Al":918,"ĠreplaceAl":919,"ĠreplaceAll":920,"RL":921,"URL":922,"net":923,"Path":924,"Wit":925,"sWit":926,"ĠfilePath":927,"ĠstartsWit":928,"ĠstartsWith":929,"ai":930,"Ġfai":931,"Ġfail":932,"Ġbuf":933,"ĠstartTime":934,"BufferedReader":935,"ĠclassName":936,"ĠgetView":937,"oString":938,"toString":939,"wid":940,"widget":941,"Ġkeys":942,"Char":943,"nce":944,"quence":945,"Sequence":946,"CharSequence":947,"Fo":948,"ns":949,"wer":950,"Ġans":951,"Ġanswer":952,"Writer":953,"exit":954,"Ġshort":955,"rc":956,"Ġsrc":957,"atter":958,"Ġpatter":959,"Ġpattern":960,"14":961,"ĠgetCol":962,"ĠgetColor":963,"java":964,"inue":965,"Ġcontinue":966,"Pro":967,"es":968,"tep":969,"Ġstep":970,"ties":971,"perties":972,"Properties":973,"getIn":974,"getInstance":975,"ClassNot":976,"undException":977,"FoundException":978,"ClassNotFoundException":979,"Float":980,"elec":981,"Ġselec":982,"Ġselect":983,"ĠintValue":984,"Ġnames":985,"FileInputStream":986,"Up":987,"perCase":988,"ĠtoUp":989,"ĠtoUpperCase":990,"Ġnodes":991,"Out":992,"FileOut":993,"FileOutputStream":994,"pr":995,"Ġexpr":996,"ĠsetSt":997,"ĠsetState":998,"Lo":999,"gger":1000,"Logger":1001,"But":1002,"ton":1003,"Button":1004,"Ġerrors":1005,"StringBuffer":1006,"Ġrow":1007,"Ġrows":1008,"aw":1009,"Ġop":1010,"awt":1011,"fig":1012,"onfig":1013,"ĠgetConfig":1014,"ds":1015,"ords":1016,"Ġwords":1017,"Ġdo":1018,"pow":1019,"ĠfieldName":1020,"Ġvar":1021,"wri":1022,"write":1023,"boolean":1024,"bst":1025,"ct":1026,"ract":1027,"bstract":1028,"ĠendTime":1029,"sort":1030,"Collections":1031,"iff":1032,"Ġdiff":1033,"random":1034,"true":1035,"15":1036,"FileWriter":1037,"Color":1038,"ation":1039,"Ġabstract":1040,"Ġoper":1041,"Ġoperation":1042,"bute":1043,"Ġat":1044,"tribute":1045,"Ġattribute":1046,"ati":1047,"ative":1048,"Ġnative":1049,"round":1050,"parseLong":1051,"ĠString":1052,"ction":1053,"nction":1054,"unction":1055,"Ġfunction":1056,"BufferedWriter":1057,"Ġ*=":1058,"Assert":1059,"assert":1060,"Ġor":1061,"test":1062,"assertEquals":1063,"Ġorg":1064,"testng":1065,"Vect":1066,"Vector":1067,"FileReader":1068,"Ġ|=":1069,"Match":1070,"eg":1071,"reg":1072,"Matcher":1073,"regex":1074,"gg":1075,"ing":1076,"getLogger":1077,"logg":1078,"logging":1079,"16":1080,"int":1081,"La":1082,"Line":1083,"yout":1084,"arLa":1085,"LinearLa":1086,"LinearLayout":1087,"false":1088,"ĠgetSe":1089,"ĠgetSelection":1090,"Ġ^":1091,"17":1092,"Ġ/=":1093,"Ġ&=":1094,"type":1095,"Co":1096,"onent":1097,"ĠaddCo":1098,"mponent":1099,"ĠaddComponent":1100,"18":1101,"Ġ~":1102,"Ġprotected":1103,"Font":1104,"final":1105,"append":1106,"Builder":1107,"ĠstringBuilder":1108,"19":1109,"Ġnot":1110,"LL":1111,"NU":1112,"ĠNU":1113,"ĠNULL":1114,"20":1115,"double":1116,"synchronized":1117,"21":1118,"long":1119,"Ġ^=":1120,"22":1121,"Ġprivate":1122,"23":1123,"<=":1124,"Ġ<<=":1125,"Ġ%=":1126,"24":1127,"abstract":1128,">=":1129,"25":1130,"byte":1131,"Ġ>>=":1132,"26":1133,"float":1134,"27":1135,">>=":1136,"Ġ>>>=":1137,"28":1138,"29":1139,"Ġimp":1140,"android":1141,"lements":1142,"Ġimplements":1143,"hort":1144,"short":1145,"30":1146,"31":1147,"32":1148,"33":1149,"34":1150,"35":1151,"36":1152,"37":1153,"38":1154,"39":1155,"native":1156,"size":1157,"unch":1158,"char":1159,"ecked":1160,"unchecked":1161}